# Лабораторна робота №3

# Завдання 1
a = 10
b = 3.14
c = "Привіт"
d = True
e = None
print(a, b, c, d, e)

# Завдання 2 
print("Це рядок з подвійними лапками")
print('Це рядок з одинарними лапками')
print("""Це рядок з потрійними лапками""")

# Завдання 3 
x = 8
y = 5

print("Сума:", x + y)
print("Різниця:", x - y)
print("Добуток:", x * y)

# Завдання 4
print(True and False)
print(True or False)

# Завдання 5
my_list = ["Яблуко", "Молоко", "Хліб"]
print(my_list)

# Завдання 6
student = {
    "ім'я": "Дмитро",
    "курс": 4,
    "стипендія": True
}

print(student)