# Лабораторна робота №7 

# Завдання 1
a = float(input("Введіть перше число: "))
b = float(input("Введіть друге число: "))

if a == b:
    print("Числа рівні")
else:
    print("Числа не рівні")
    
# Завдання 2
num = float(input("Введіть число: "))

if num > 0:
    print("Число більше нуля")
else:
    print("Число не більше нуля")

# Завдання 3
str1 = input("Введіть перший рядок: ")
str2 = input("Введіть другий рядок: ")

if str1 == str2:
    print("Рядки однакові")
else:
    print("Рядки різні")
    
# Завдання 4
num1 = int(input("Введіть число: "))

if 1 <= num1 <= 100:
    print("Число входить у діапазон")
else:
    print("Число не входить у діапазон")

# Завдання 5
login = "admin"
user_login = input("Введіть логін: ")

if user_login == login:
    print("Доступ дозволено")
else:
    print("Доступ заборонено")

# Завдання 6
x = float(input("Введіть перше число: "))
y = float(input("Введіть друге число: "))
z = float(input("Введіть третє число: "))

if x < y and y < z:
    print("Числа розташовані у порядку зростання")
else:
    print("Числа НЕ розташовані у порядку зростання")